{
  "irVersion": 9,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "assets": {
      "kind": "path",
      "patterns": [
        "/assets/*"
      ]
    },
    "html": {
      "kind": "content_type",
      "contentTypes": [
        "text/html"
      ],
      "responsePhase": true
    }
  },
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "url"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "url"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "30s",
        "grace": "10m0s"
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      }
    ]
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "usesGeo": false,
  "edge": {
    "policies": [
      {
        "scope": {
          "names": [
            "html"
          ]
        },
        "tier": "distribute"
      },
      {
        "scope": {
          "names": [
            "assets"
          ]
        },
        "tier": "skip"
      }
    ],
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
