{
  "irVersion": 4,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "eu": {
      "kind": "geo",
      "geoGranularity": "continent",
      "geoValues": [
        "EU"
      ]
    },
    "regulated": {
      "kind": "geo",
      "geoGranularity": "region",
      "geoValues": [
        "US-TX",
        "US-UT"
      ]
    }
  },
  "recv": {
    "pass": [
      {
        "names": [
          "regulated"
        ]
      }
    ],
    "redirect": [
      {
        "scope": {
          "names": [
            "eu"
          ]
        },
        "status": 302,
        "target": "https://eu.example.com{uri}"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "method"
      },
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "method"
          },
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      }
    ]
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
