{
  "irVersion": 9,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "assets": {
      "kind": "path_regex",
      "regex": "\\.(css|js|png|jpe?g)$",
      "regexFlags": "is"
    },
    "bypass_admin": {
      "kind": "path_regex",
      "regex": "^/(atvpanel|admin|api)",
      "regexFlags": "i"
    }
  },
  "recv": {
    "pass": [
      {
        "names": [
          "bypass_admin"
        ]
      },
      {
        "names": [
          "assets"
        ]
      }
    ],
    "redirect": [
      {
        "regex": "^/cams/?$",
        "regexFlags": "i",
        "status": 301,
        "target": "https://example.com/broadcast"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s",
        "grace": "5m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
