{
  "irVersion": 9,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "__edge.classify.lang.0.0": {
      "kind": "cookie",
      "name": "selectedLanguage",
      "values": [
        "es"
      ]
    },
    "__edge.classify.lang.1.0": {
      "kind": "cookie",
      "name": "selectedLanguage",
      "values": [
        "en"
      ]
    },
    "__edge.classify.lang.2.0": {
      "kind": "header",
      "name": "Accept-Language",
      "values": [
        "es"
      ]
    }
  },
  "classifiers": {
    "lang": {
      "rows": [
        {
          "conj": [
            "__edge.classify.lang.0.0"
          ],
          "value": "es"
        },
        {
          "conj": [
            "__edge.classify.lang.1.0"
          ],
          "value": "en"
        },
        {
          "conj": [
            "__edge.classify.lang.2.0"
          ],
          "value": "es"
        }
      ],
      "default": "en"
    }
  },
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      },
      {
        "kind": "classify",
        "ref": "lang"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          },
          {
            "kind": "classify",
            "ref": "lang"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s",
        "grace": "5m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
