{
  "irVersion": 4,
  "site": {
    "hosts": [
      "shop.example.com",
      "*.cdn.example.com"
    ],
    "redirectHosts": [
      "*.cdn.example.com",
      "shop.example.com"
    ],
    "canonicalHost": "shop.example.com"
  },
  "upstream": {},
  "matchers": {},
  "recv": {
    "redirect": [
      {
        "regex": "^/old/(.*)$",
        "status": 301,
        "target": "https://{host}/new/$1"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s",
        "grace": "5m0s"
      }
    ]
  },
  "deliver": {},
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
