{
  "irVersion": 9,
  "site": {
    "hosts": [
      "big.example.com"
    ],
    "redirectHosts": [
      "big.example.com"
    ],
    "canonicalHost": "big.example.com"
  },
  "upstream": {},
  "matchers": {
    "html": {
      "kind": "content_type",
      "contentTypes": [
        "text/html"
      ],
      "responsePhase": true
    }
  },
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "method"
      },
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ],
    "transforms": [
      {
        "scope": {
          "names": [
            "html"
          ]
        },
        "old": "__TITLE__",
        "new": "Welcome"
      }
    ],
    "transformMaxBytes": 1048576
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
