{
  "irVersion": 6,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {},
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "method"
      },
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "status_in",
        "codes": [
          404
        ],
        "ttl": "1m0s",
        "grace": "24h0m0s",
        "respHeader": {
          "kind": "resp_header",
          "name": "X-Powered-By",
          "values": [
            "Express"
          ],
          "responsePhase": true
        }
      },
      {
        "selKind": "default",
        "ttl": "1m0s",
        "grace": "336h0m0s",
        "respHeader": {
          "kind": "resp_header",
          "name": "X-Powered-By",
          "values": [
            "Express"
          ],
          "responsePhase": true
        }
      },
      {
        "selKind": "status_in",
        "codes": [
          404
        ],
        "ttl": "10s",
        "grace": "1m0s"
      },
      {
        "selKind": "default",
        "ttl": "5s",
        "grace": "1m0s"
      }
    ],
    "storage": [
      {
        "selKind": "default",
        "tier": "ram"
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      }
    ]
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
