{
  "irVersion": 9,
  "site": {
    "hosts": [
      "edge.example.com"
    ],
    "redirectHosts": [
      "edge.example.com"
    ],
    "canonicalHost": "edge.example.com"
  },
  "upstream": {},
  "matchers": {},
  "recv": {
    "redirect": [
      {
        "regex": "^/go/(.*)$",
        "status": 302,
        "target": "{proto}://{host}/landing/$1"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
