{
  "irVersion": 9,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "en_target": {
      "kind": "classify",
      "classifyToken": "langredir",
      "classifyValue": "en"
    },
    "es_target": {
      "kind": "classify",
      "classifyToken": "langredir",
      "classifyValue": "es"
    },
    "lang_en": {
      "kind": "header_regex",
      "regex": "^en",
      "regexFlags": "i",
      "name": "Accept-Language"
    },
    "lang_es": {
      "kind": "header_regex",
      "regex": "^es",
      "regexFlags": "i",
      "name": "Accept-Language"
    }
  },
  "classifiers": {
    "langredir": {
      "rows": [
        {
          "conj": [
            "lang_es"
          ],
          "value": "es"
        },
        {
          "conj": [
            "lang_en"
          ],
          "value": "en"
        }
      ],
      "default": "none"
    }
  },
  "recv": {
    "redirect": [
      {
        "regex": "^(.*)/(couples|parejas)/?$",
        "regexFlags": "i",
        "scope": {
          "names": [
            "es_target"
          ]
        },
        "status": 301,
        "target": "https://{host}$1/parejas"
      },
      {
        "regex": "^(.*)/(couples|parejas)/?$",
        "regexFlags": "i",
        "scope": {
          "names": [
            "en_target"
          ]
        },
        "status": 301,
        "target": "https://{host}$1/couples"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s",
        "grace": "5m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
