{
  "irVersion": 6,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "ws": {
      "kind": "path",
      "patterns": [
        "/ws/*"
      ]
    }
  },
  "recv": {
    "pass": [
      {
        "names": [
          "ws"
        ]
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1h0m0s"
      }
    ]
  },
  "deliver": {},
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  },
  "delegate": [
    {
      "directive": "upgrade",
      "reason": "a connection-upgrade (WebSocket / Connection: Upgrade) passthrough tunnel is a live, hijacked bidirectional connection the Cadish server holds open; an edge worker cannot host it, so an upgrade route runs on the Cadish server behind",
      "scope": {
        "names": [
          "ws"
        ]
      }
    }
  ]
}
