{
  "irVersion": 6,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "gated": {
      "kind": "classify",
      "classifyToken": "age",
      "classifyValue": "gate"
    },
    "ungreedy": {
      "kind": "path_regex",
      "regexUntranslatable": true
    }
  },
  "classifiers": {
    "age": {
      "rows": [
        {
          "conj": [
            "ungreedy"
          ],
          "value": "gate"
        }
      ],
      "default": "open"
    }
  },
  "recv": {
    "pass": [
      {
        "always": true
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1h0m0s"
      }
    ]
  },
  "deliver": {},
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  },
  "delegate": [
    {
      "directive": "path_regex",
      "reason": "matcher @ungreedy uses a RE2 regex construct with no faithful JavaScript RegExp equivalent (e.g. ungreedy `(?U)`, a scoped `(?i:…)` group, or a mid-pattern inline flag); it is failed-closed at the edge, so any directive matching on it must run on the Cadish server behind"
    }
  ]
}
