{
  "irVersion": 6,
  "site": {
    "hosts": [
      "es.nudity.tv",
      "www.amateur.tv",
      "nudity.tv",
      "cam4you.tech555.io"
    ],
    "redirectHosts": [
      "cam4you.tech555.io",
      "es.nudity.tv",
      "nudity.tv",
      "www.amateur.tv"
    ],
    "canonicalHost": "es.nudity.tv"
  },
  "upstream": {},
  "matchers": {},
  "recv": {
    "redirect": [
      {
        "regex": "^/(.*)$",
        "status": 302,
        "target": "https://www.{host.base}/lang/{host.sub}/$1"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ]
  },
  "deliver": {},
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
