{
  "irVersion": 9,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "premium": {
      "kind": "cookie",
      "name": "tier",
      "values": [
        "premium"
      ]
    },
    "rm": {
      "kind": "path_regex",
      "regex": "^/v3/readmodel/cache/"
    }
  },
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "scope",
        "scope": {
          "names": [
            "premium"
          ]
        },
        "fromHeader": "X-Cache-Ttl",
        "stripHeaders": [
          "X-Cache-Ttl"
        ]
      },
      {
        "selKind": "default",
        "hitForMiss": "0s",
        "isHFM": true
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      }
    ],
    "hasStripHeaders": true
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "usesGeo": false,
  "cacheCredentialed": [
    {
      "names": [
        "rm"
      ]
    }
  ],
  "cookieAllow": [
    "session"
  ],
  "cookieAllowSet": true,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
