{
  "irVersion": 6,
  "site": {
    "hosts": [
      "example.com"
    ],
    "redirectHosts": [
      "example.com"
    ],
    "canonicalHost": "example.com"
  },
  "upstream": {},
  "matchers": {
    "admin": {
      "kind": "header_json",
      "name": "X-Auth",
      "values": [
        "admin"
      ],
      "jsonPath": "role"
    }
  },
  "recv": {
    "pass": [
      {
        "names": [
          "admin"
        ]
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "method"
      },
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      }
    ]
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
