{
  "irVersion": 9,
  "site": {
    "hosts": [
      "dev.example.com"
    ],
    "redirectHosts": [
      "dev.example.com"
    ],
    "canonicalHost": "dev.example.com"
  },
  "upstream": {},
  "matchers": {},
  "device": {
    "rules": [
      {
        "class": "mobile",
        "substrings": [
          "iphone",
          "android"
        ]
      },
      {
        "class": "tablet",
        "substrings": [
          "ipad"
        ]
      },
      {
        "class": "bot",
        "substrings": [
          "bot",
          "bot"
        ]
      }
    ],
    "default": "desktop"
  },
  "recv": {},
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      },
      {
        "kind": "device"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          },
          {
            "kind": "device"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ],
    "headerResp": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "cache_status",
            "name": "X-Cache"
          }
        ]
      },
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "set",
            "name": "X-Device-Class",
            "value": "{device}",
            "valueIsTmpl": true
          }
        ]
      }
    ]
  },
  "deliver": {
    "cacheStatusHeader": "X-Cache"
  },
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
