{
  "irVersion": 9,
  "site": {
    "hosts": [
      "media.example.com"
    ],
    "redirectHosts": [
      "media.example.com"
    ],
    "canonicalHost": "media.example.com"
  },
  "upstream": {},
  "matchers": {},
  "device": {
    "rules": [
      {
        "class": "bot",
        "substrings": [
          "bot",
          "crawler",
          "spider",
          "slurp",
          "facebookexternalhit",
          "bingpreview"
        ]
      },
      {
        "class": "tablet",
        "substrings": [
          "ipad",
          "tablet",
          "kindle",
          "silk",
          "playbook"
        ]
      },
      {
        "class": "tablet",
        "substrings": [
          "android"
        ],
        "exclude": [
          "mobile"
        ]
      },
      {
        "class": "mobile",
        "substrings": [
          "mobile",
          "android",
          "iphone",
          "ipod",
          "blackberry",
          "opera mini",
          "windows phone"
        ]
      }
    ],
    "default": "desktop"
  },
  "recv": {
    "redirect": [
      {
        "regex": "^/goto$",
        "status": 302,
        "target": "https://media.example.com/browse/{query.genre}"
      },
      {
        "regex": "^/m/(.*)$",
        "status": 302,
        "target": "https://media.example.com/{device}/$1"
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "method"
      },
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
