{
  "irVersion": 9,
  "site": {
    "hosts": [
      "geo.example.com"
    ],
    "redirectHosts": [
      "geo.example.com"
    ],
    "canonicalHost": "geo.example.com"
  },
  "upstream": {},
  "matchers": {},
  "recv": {
    "headerReq": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "set",
            "name": "X-Geo",
            "value": "{geo}",
            "valueIsTmpl": true
          }
        ]
      },
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "set",
            "name": "X-Region",
            "value": "{geo.region}",
            "valueIsTmpl": true
          }
        ]
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": false,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
