{
  "irVersion": 9,
  "site": {
    "hosts": [
      "x.example.com"
    ],
    "redirectHosts": [
      "x.example.com"
    ],
    "canonicalHost": "x.example.com"
  },
  "upstream": {},
  "matchers": {
    "de": {
      "kind": "geo",
      "geoGranularity": "country",
      "geoValues": [
        "DE"
      ]
    }
  },
  "classifiers": {
    "tier": {
      "rows": [
        {
          "conj": [
            "de"
          ],
          "value": "eu"
        }
      ],
      "default": "row"
    }
  },
  "recv": {
    "headerReq": [
      {
        "scope": {
          "always": true
        },
        "ops": [
          {
            "op": "set",
            "name": "X-Tier",
            "value": "{classify.tier}",
            "valueIsTmpl": true
          }
        ]
      }
    ]
  },
  "key": {
    "tokens": [
      {
        "kind": "host"
      },
      {
        "kind": "path"
      }
    ],
    "recipes": [
      {
        "selector": {
          "always": true
        },
        "tokens": [
          {
            "kind": "host"
          },
          {
            "kind": "path"
          }
        ]
      }
    ]
  },
  "response": {
    "ttl": [
      {
        "selKind": "default",
        "ttl": "1m0s"
      }
    ]
  },
  "deliver": {},
  "usesGeo": true,
  "edge": {
    "default": "local",
    "kvMaxBytes": 1048576
  }
}
